#ifndef FUNNY_MATH_COMMENTS_HPP
#define FUNNY_MATH_COMMENTS_HPP

const char* MATH_PHRASES[] = 
{
    "Со времён греков известно",
    "Математика принадлежит к числу тех наук, которые ясны сами по себе",
    "Легко заметить",
    "И ежу понятно, что",
    "В самом деле",
    "Очев",
    "По теореме Петухова-Ландау",
    "Таким образом",
    "Читатель с более чем уд 3 по дискре сразу заметит",
    "К сожалению, матанализ-матанализ показывает, что",
    "Говоря простыми словам, ваывларыварывльвлм",
    "Однажды один орёл взлетел и как вхреначился в скалу...",
    "Время матанализ, между нами ангем, dx-dx-dx",
    "Люди, решившие загадку Жака Фреско сразу поймут",
    "Понаехали тут",
    "Катая у Бахи",
    "Петровичу приснилось во сне, что",
};

static const size_t NUMBER_OF_PHRASES = sizeof(MATH_PHRASES) / sizeof(*MATH_PHRASES);

#endif
